{"keras_version": "1.1.0", "class_name": "Model", "config": {"name": "model_1", "output_layers": [["convolution2d_11", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "input_1", "batch_input_shape": [null, 128, 128, 3], "input_dtype": "float32", "sparse": false}}, {"name": "convolution2d_1", "inbound_nodes": [[["input_1", 0, 0]]], "class_name": "Convolution2D", "config": {"border_mode": "same", "init": "glorot_uniform", "nb_row": 9, "activity_regularizer": null, "bias": true, "nb_filter": 32, "subsample": [1, 1], "W_regularizer": null, "b_regularizer": null, "name": "convolution2d_1", "batch_input_shape": [null, 128, 128, 3], "activation": "linear", "trainable": true, "input_dtype": "float32", "nb_col": 9, "dim_ordering": "tf", "b_constraint": null, "W_constraint": null}}, {"name": "leakyrelu_1", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "class_name": "LeakyReLU", "config": {"name": "leakyrelu_1", "alpha": 0.01, "trainable": true}}, {"name": "convolution2d_2", "inbound_nodes": [[["leakyrelu_1", 0, 0]]], "class_name": "Convolution2D", "config": {"border_mode": "same", "init": "glorot_uniform", "nb_row": 5, "name": "convolution2d_2", "bias": true, "nb_filter": 64, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "trainable": true, "nb_col": 5, "subsample": [1, 1], "dim_ordering": "tf", "b_constraint": null, "W_constraint": null}}, {"name": "leakyrelu_2", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "class_name": "LeakyReLU", "config": {"name": "leakyrelu_2", "alpha": 0.01, "trainable": true}}, {"name": "maxpooling2d_1", "inbound_nodes": [[["leakyrelu_2", 0, 0]]], "class_name": "MaxPooling2D", "config": {"border_mode": "valid", "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "tf", "strides": [2, 2]}}, {"name": "convolution2d_3", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "class_name": "Convolution2D", "config": {"border_mode": "same", "init": "glorot_uniform", "nb_row": 5, "name": "convolution2d_3", "bias": true, "nb_filter": 128, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "trainable": true, "nb_col": 5, "subsample": [1, 1], "dim_ordering": "tf", "b_constraint": null, "W_constraint": null}}, {"name": "leakyrelu_3", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "class_name": "LeakyReLU", "config": {"name": "leakyrelu_3", "alpha": 0.01, "trainable": true}}, {"name": "maxpooling2d_2", "inbound_nodes": [[["leakyrelu_3", 0, 0]]], "class_name": "MaxPooling2D", "config": {"border_mode": "valid", "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_2", "dim_ordering": "tf", "strides": [2, 2]}}, {"name": "convolution2d_4", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "class_name": "Convolution2D", "config": {"border_mode": "same", "init": "glorot_uniform", "nb_row": 3, "name": "convolution2d_4", "bias": true, "nb_filter": 128, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "trainable": true, "nb_col": 3, "subsample": [1, 1], "dim_ordering": "tf", "b_constraint": null, "W_constraint": null}}, {"name": "leakyrelu_4", "inbound_nodes": [[["convolution2d_4", 0, 0]]], "class_name": "LeakyReLU", "config": {"name": "leakyrelu_4", "alpha": 0.01, "trainable": true}}, {"name": "convolution2d_5", "inbound_nodes": [[["leakyrelu_4", 0, 0]]], "class_name": "Convolution2D", "config": {"border_mode": "same", "init": "glorot_uniform", "nb_row": 3, "name": "convolution2d_5", "bias": true, "nb_filter": 128, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "trainable": true, "nb_col": 3, "subsample": [1, 1], "dim_ordering": "tf", "b_constraint": null, "W_constraint": null}}, {"name": "leakyrelu_5", "inbound_nodes": [[["convolution2d_5", 0, 0]]], "class_name": "LeakyReLU", "config": {"name": "leakyrelu_5", "alpha": 0.01, "trainable": true}}, {"name": "convolution2d_6", "inbound_nodes": [[["leakyrelu_5", 0, 0]]], "class_name": "Convolution2D", "config": {"border_mode": "same", "init": "glorot_uniform", "nb_row": 3, "name": "convolution2d_6", "bias": true, "nb_filter": 128, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "trainable": true, "nb_col": 3, "subsample": [1, 1], "dim_ordering": "tf", "b_constraint": null, "W_constraint": null}}, {"name": "leakyrelu_6", "inbound_nodes": [[["convolution2d_6", 0, 0]]], "class_name": "LeakyReLU", "config": {"name": "leakyrelu_6", "alpha": 0.01, "trainable": true}}, {"name": "convolution2d_7", "inbound_nodes": [[["leakyrelu_6", 0, 0]]], "class_name": "Convolution2D", "config": {"border_mode": "same", "init": "glorot_uniform", "nb_row": 3, "name": "convolution2d_7", "bias": true, "nb_filter": 128, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "trainable": true, "nb_col": 3, "subsample": [1, 1], "dim_ordering": "tf", "b_constraint": null, "W_constraint": null}}, {"name": "leakyrelu_7", "inbound_nodes": [[["convolution2d_7", 0, 0]]], "class_name": "LeakyReLU", "config": {"name": "leakyrelu_7", "alpha": 0.01, "trainable": true}}, {"name": "convolution2d_8", "inbound_nodes": [[["leakyrelu_7", 0, 0]]], "class_name": "Convolution2D", "config": {"border_mode": "same", "init": "glorot_uniform", "nb_row": 3, "name": "convolution2d_8", "bias": true, "nb_filter": 128, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "trainable": true, "nb_col": 3, "subsample": [1, 1], "dim_ordering": "tf", "b_constraint": null, "W_constraint": null}}, {"name": "leakyrelu_8", "inbound_nodes": [[["convolution2d_8", 0, 0]]], "class_name": "LeakyReLU", "config": {"name": "leakyrelu_8", "alpha": 0.01, "trainable": true}}, {"name": "upsampling2d_1", "inbound_nodes": [[["leakyrelu_8", 0, 0]]], "class_name": "UpSampling2D", "config": {"name": "upsampling2d_1", "size": [2, 2], "trainable": true}}, {"name": "convolution2d_9", "inbound_nodes": [[["upsampling2d_1", 0, 0]]], "class_name": "Convolution2D", "config": {"border_mode": "same", "init": "glorot_uniform", "nb_row": 5, "name": "convolution2d_9", "bias": true, "nb_filter": 128, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "trainable": true, "nb_col": 5, "subsample": [1, 1], "dim_ordering": "tf", "b_constraint": null, "W_constraint": null}}, {"name": "leakyrelu_9", "inbound_nodes": [[["convolution2d_9", 0, 0]]], "class_name": "LeakyReLU", "config": {"name": "leakyrelu_9", "alpha": 0.01, "trainable": true}}, {"name": "upsampling2d_2", "inbound_nodes": [[["leakyrelu_9", 0, 0]]], "class_name": "UpSampling2D", "config": {"name": "upsampling2d_2", "size": [2, 2], "trainable": true}}, {"name": "convolution2d_10", "inbound_nodes": [[["upsampling2d_2", 0, 0]]], "class_name": "Convolution2D", "config": {"border_mode": "same", "init": "glorot_uniform", "nb_row": 5, "name": "convolution2d_10", "bias": true, "nb_filter": 64, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "trainable": true, "nb_col": 5, "subsample": [1, 1], "dim_ordering": "tf", "b_constraint": null, "W_constraint": null}}, {"name": "leakyrelu_10", "inbound_nodes": [[["convolution2d_10", 0, 0]]], "class_name": "LeakyReLU", "config": {"name": "leakyrelu_10", "alpha": 0.01, "trainable": true}}, {"name": "convolution2d_11", "inbound_nodes": [[["leakyrelu_10", 0, 0]]], "class_name": "Convolution2D", "config": {"border_mode": "same", "init": "glorot_uniform", "nb_row": 9, "name": "convolution2d_11", "bias": true, "nb_filter": 3, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "activation": "tanh", "trainable": true, "nb_col": 9, "subsample": [1, 1], "dim_ordering": "tf", "b_constraint": null, "W_constraint": null}}], "input_layers": [["input_1", 0, 0]]}}
