{"class_name": "Model", "keras_version": "1.1.0", "config": {"name": "model_1", "output_layers": [["convolution2d_11", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"input_dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "name": "input_1", "sparse": false}}, {"class_name": "Convolution2D", "name": "convolution2d_1", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"activation": "linear", "trainable": true, "nb_filter": 32, "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 9, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_1", "subsample": [1, 1], "b_constraint": null, "input_dtype": "float32", "nb_col": 9, "batch_input_shape": [null, 64, 64, 3], "W_constraint": null, "border_mode": "same", "W_regularizer": null}}, {"class_name": "LeakyReLU", "name": "leakyrelu_1", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "config": {"alpha": 0.01, "trainable": true, "name": "leakyrelu_1"}}, {"class_name": "Convolution2D", "name": "convolution2d_2", "inbound_nodes": [[["leakyrelu_1", 0, 0]]], "config": {"activation": "linear", "trainable": true, "nb_filter": 64, "b_constraint": null, "nb_row": 5, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_2", "subsample": [1, 1], "dim_ordering": "tf", "nb_col": 5, "W_constraint": null, "activity_regularizer": null, "border_mode": "same", "W_regularizer": null}}, {"class_name": "LeakyReLU", "name": "leakyrelu_2", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "config": {"alpha": 0.01, "trainable": true, "name": "leakyrelu_2"}}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_1", "inbound_nodes": [[["leakyrelu_2", 0, 0]]], "config": {"name": "maxpooling2d_1", "strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true, "border_mode": "valid"}}, {"class_name": "Convolution2D", "name": "convolution2d_3", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "config": {"activation": "linear", "trainable": true, "nb_filter": 128, "b_constraint": null, "nb_row": 5, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_3", "subsample": [1, 1], "dim_ordering": "tf", "nb_col": 5, "W_constraint": null, "activity_regularizer": null, "border_mode": "same", "W_regularizer": null}}, {"class_name": "LeakyReLU", "name": "leakyrelu_3", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "config": {"alpha": 0.01, "trainable": true, "name": "leakyrelu_3"}}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_2", "inbound_nodes": [[["leakyrelu_3", 0, 0]]], "config": {"name": "maxpooling2d_2", "strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true, "border_mode": "valid"}}, {"class_name": "Convolution2D", "name": "convolution2d_4", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "config": {"activation": "linear", "trainable": true, "nb_filter": 128, "b_constraint": null, "nb_row": 3, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_4", "subsample": [1, 1], "dim_ordering": "tf", "nb_col": 3, "W_constraint": null, "activity_regularizer": null, "border_mode": "same", "W_regularizer": null}}, {"class_name": "LeakyReLU", "name": "leakyrelu_4", "inbound_nodes": [[["convolution2d_4", 0, 0]]], "config": {"alpha": 0.01, "trainable": true, "name": "leakyrelu_4"}}, {"class_name": "Convolution2D", "name": "convolution2d_5", "inbound_nodes": [[["leakyrelu_4", 0, 0]]], "config": {"activation": "linear", "trainable": true, "nb_filter": 128, "b_constraint": null, "nb_row": 3, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_5", "subsample": [1, 1], "dim_ordering": "tf", "nb_col": 3, "W_constraint": null, "activity_regularizer": null, "border_mode": "same", "W_regularizer": null}}, {"class_name": "LeakyReLU", "name": "leakyrelu_5", "inbound_nodes": [[["convolution2d_5", 0, 0]]], "config": {"alpha": 0.01, "trainable": true, "name": "leakyrelu_5"}}, {"class_name": "Convolution2D", "name": "convolution2d_6", "inbound_nodes": [[["leakyrelu_5", 0, 0]]], "config": {"activation": "linear", "trainable": true, "nb_filter": 128, "b_constraint": null, "nb_row": 3, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_6", "subsample": [1, 1], "dim_ordering": "tf", "nb_col": 3, "W_constraint": null, "activity_regularizer": null, "border_mode": "same", "W_regularizer": null}}, {"class_name": "LeakyReLU", "name": "leakyrelu_6", "inbound_nodes": [[["convolution2d_6", 0, 0]]], "config": {"alpha": 0.01, "trainable": true, "name": "leakyrelu_6"}}, {"class_name": "Convolution2D", "name": "convolution2d_7", "inbound_nodes": [[["leakyrelu_6", 0, 0]]], "config": {"activation": "linear", "trainable": true, "nb_filter": 128, "b_constraint": null, "nb_row": 3, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_7", "subsample": [1, 1], "dim_ordering": "tf", "nb_col": 3, "W_constraint": null, "activity_regularizer": null, "border_mode": "same", "W_regularizer": null}}, {"class_name": "LeakyReLU", "name": "leakyrelu_7", "inbound_nodes": [[["convolution2d_7", 0, 0]]], "config": {"alpha": 0.01, "trainable": true, "name": "leakyrelu_7"}}, {"class_name": "Convolution2D", "name": "convolution2d_8", "inbound_nodes": [[["leakyrelu_7", 0, 0]]], "config": {"activation": "linear", "trainable": true, "nb_filter": 128, "b_constraint": null, "nb_row": 3, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_8", "subsample": [1, 1], "dim_ordering": "tf", "nb_col": 3, "W_constraint": null, "activity_regularizer": null, "border_mode": "same", "W_regularizer": null}}, {"class_name": "LeakyReLU", "name": "leakyrelu_8", "inbound_nodes": [[["convolution2d_8", 0, 0]]], "config": {"alpha": 0.01, "trainable": true, "name": "leakyrelu_8"}}, {"class_name": "UpSampling2D", "name": "upsampling2d_1", "inbound_nodes": [[["leakyrelu_8", 0, 0]]], "config": {"name": "upsampling2d_1", "trainable": true, "size": [2, 2]}}, {"class_name": "Convolution2D", "name": "convolution2d_9", "inbound_nodes": [[["upsampling2d_1", 0, 0]]], "config": {"activation": "linear", "trainable": true, "nb_filter": 128, "b_constraint": null, "nb_row": 5, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_9", "subsample": [1, 1], "dim_ordering": "tf", "nb_col": 5, "W_constraint": null, "activity_regularizer": null, "border_mode": "same", "W_regularizer": null}}, {"class_name": "LeakyReLU", "name": "leakyrelu_9", "inbound_nodes": [[["convolution2d_9", 0, 0]]], "config": {"alpha": 0.01, "trainable": true, "name": "leakyrelu_9"}}, {"class_name": "UpSampling2D", "name": "upsampling2d_2", "inbound_nodes": [[["leakyrelu_9", 0, 0]]], "config": {"name": "upsampling2d_2", "trainable": true, "size": [2, 2]}}, {"class_name": "Convolution2D", "name": "convolution2d_10", "inbound_nodes": [[["upsampling2d_2", 0, 0]]], "config": {"activation": "linear", "trainable": true, "nb_filter": 64, "b_constraint": null, "nb_row": 5, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_10", "subsample": [1, 1], "dim_ordering": "tf", "nb_col": 5, "W_constraint": null, "activity_regularizer": null, "border_mode": "same", "W_regularizer": null}}, {"class_name": "LeakyReLU", "name": "leakyrelu_10", "inbound_nodes": [[["convolution2d_10", 0, 0]]], "config": {"alpha": 0.01, "trainable": true, "name": "leakyrelu_10"}}, {"class_name": "Convolution2D", "name": "convolution2d_11", "inbound_nodes": [[["leakyrelu_10", 0, 0]]], "config": {"activation": "tanh", "trainable": true, "nb_filter": 3, "b_constraint": null, "nb_row": 9, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_11", "subsample": [1, 1], "dim_ordering": "tf", "nb_col": 9, "W_constraint": null, "activity_regularizer": null, "border_mode": "same", "W_regularizer": null}}], "input_layers": [["input_1", 0, 0]]}}