{"config": {"output_layers": [["convolution2d_11", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 64, 64, 3], "input_dtype": "float32", "name": "input_1"}, "class_name": "InputLayer", "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0]]], "config": {"input_dtype": "float32", "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "nb_col": 9, "bias": true, "dim_ordering": "tf", "name": "convolution2d_1", "b_constraint": null, "W_regularizer": null, "nb_filter": 64, "batch_input_shape": [null, 64, 64, 3], "W_constraint": null, "nb_row": 9, "subsample": [1, 1]}, "class_name": "Convolution2D", "name": "convolution2d_1"}, {"inbound_nodes": [[["convolution2d_1", 0, 0]]], "config": {"trainable": true, "alpha": 0.01, "name": "leakyrelu_1"}, "class_name": "LeakyReLU", "name": "leakyrelu_1"}, {"inbound_nodes": [[["leakyrelu_1", 0, 0]]], "config": {"strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_1", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "name": "maxpooling2d_1"}, {"inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "config": {"trainable": true, "alpha": 0.01, "name": "leakyrelu_2"}, "class_name": "LeakyReLU", "name": "leakyrelu_2"}, {"inbound_nodes": [[["leakyrelu_2", 0, 0]]], "config": {"init": "glorot_uniform", "activation": "linear", "border_mode": "same", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "nb_col": 5, "bias": true, "dim_ordering": "tf", "name": "convolution2d_2", "b_constraint": null, "W_regularizer": null, "nb_filter": 128, "W_constraint": null, "nb_row": 5, "subsample": [1, 1]}, "class_name": "Convolution2D", "name": "convolution2d_2"}, {"inbound_nodes": [[["convolution2d_2", 0, 0]]], "config": {"strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_2", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "name": "maxpooling2d_2"}, {"inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "config": {"trainable": true, "alpha": 0.01, "name": "leakyrelu_3"}, "class_name": "LeakyReLU", "name": "leakyrelu_3"}, {"inbound_nodes": [[["leakyrelu_3", 0, 0]]], "config": {"init": "glorot_uniform", "activation": "linear", "border_mode": "same", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "nb_col": 3, "bias": true, "dim_ordering": "tf", "name": "convolution2d_3", "b_constraint": null, "W_regularizer": null, "nb_filter": 256, "W_constraint": null, "nb_row": 3, "subsample": [1, 1]}, "class_name": "Convolution2D", "name": "convolution2d_3"}, {"inbound_nodes": [[["convolution2d_3", 0, 0]]], "config": {"init": "glorot_uniform", "activation": "linear", "border_mode": "same", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "nb_col": 3, "bias": true, "dim_ordering": "tf", "name": "convolution2d_4", "b_constraint": null, "W_regularizer": null, "nb_filter": 256, "W_constraint": null, "nb_row": 3, "subsample": [1, 1]}, "class_name": "Convolution2D", "name": "convolution2d_4"}, {"inbound_nodes": [[["convolution2d_4", 0, 0]]], "config": {"trainable": true, "alpha": 0.01, "name": "leakyrelu_4"}, "class_name": "LeakyReLU", "name": "leakyrelu_4"}, {"inbound_nodes": [[["leakyrelu_4", 0, 0]]], "config": {"init": "glorot_uniform", "activation": "linear", "border_mode": "same", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "nb_col": 3, "bias": true, "dim_ordering": "tf", "name": "convolution2d_5", "b_constraint": null, "W_regularizer": null, "nb_filter": 256, "W_constraint": null, "nb_row": 3, "subsample": [1, 1]}, "class_name": "Convolution2D", "name": "convolution2d_5"}, {"inbound_nodes": [[["convolution2d_5", 0, 0]]], "config": {"trainable": true, "alpha": 0.01, "name": "leakyrelu_5"}, "class_name": "LeakyReLU", "name": "leakyrelu_5"}, {"inbound_nodes": [[["leakyrelu_5", 0, 0]]], "config": {"init": "glorot_uniform", "activation": "linear", "border_mode": "same", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "nb_col": 3, "bias": true, "dim_ordering": "tf", "name": "convolution2d_6", "b_constraint": null, "W_regularizer": null, "nb_filter": 256, "W_constraint": null, "nb_row": 3, "subsample": [1, 1]}, "class_name": "Convolution2D", "name": "convolution2d_6"}, {"inbound_nodes": [[["convolution2d_6", 0, 0]]], "config": {"trainable": true, "alpha": 0.01, "name": "leakyrelu_6"}, "class_name": "LeakyReLU", "name": "leakyrelu_6"}, {"inbound_nodes": [[["leakyrelu_6", 0, 0]]], "config": {"init": "glorot_uniform", "activation": "linear", "border_mode": "same", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "nb_col": 3, "bias": true, "dim_ordering": "tf", "name": "convolution2d_7", "b_constraint": null, "W_regularizer": null, "nb_filter": 256, "W_constraint": null, "nb_row": 3, "subsample": [1, 1]}, "class_name": "Convolution2D", "name": "convolution2d_7"}, {"inbound_nodes": [[["convolution2d_7", 0, 0]]], "config": {"trainable": true, "alpha": 0.01, "name": "leakyrelu_7"}, "class_name": "LeakyReLU", "name": "leakyrelu_7"}, {"inbound_nodes": [[["leakyrelu_7", 0, 0]]], "config": {"init": "glorot_uniform", "activation": "linear", "border_mode": "same", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "nb_col": 3, "bias": true, "dim_ordering": "tf", "name": "convolution2d_8", "b_constraint": null, "W_regularizer": null, "nb_filter": 256, "W_constraint": null, "nb_row": 3, "subsample": [1, 1]}, "class_name": "Convolution2D", "name": "convolution2d_8"}, {"inbound_nodes": [[["convolution2d_8", 0, 0]]], "config": {"trainable": true, "alpha": 0.01, "name": "leakyrelu_8"}, "class_name": "LeakyReLU", "name": "leakyrelu_8"}, {"inbound_nodes": [[["leakyrelu_8", 0, 0]]], "config": {"trainable": true, "size": [2, 2], "name": "upsampling2d_1"}, "class_name": "UpSampling2D", "name": "upsampling2d_1"}, {"inbound_nodes": [[["upsampling2d_1", 0, 0]]], "config": {"init": "glorot_uniform", "activation": "linear", "border_mode": "same", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "nb_col": 3, "bias": true, "dim_ordering": "tf", "name": "convolution2d_9", "b_constraint": null, "W_regularizer": null, "nb_filter": 128, "W_constraint": null, "nb_row": 3, "subsample": [1, 1]}, "class_name": "Convolution2D", "name": "convolution2d_9"}, {"inbound_nodes": [[["convolution2d_9", 0, 0]]], "config": {"trainable": true, "alpha": 0.01, "name": "leakyrelu_9"}, "class_name": "LeakyReLU", "name": "leakyrelu_9"}, {"inbound_nodes": [[["convolution2d_2", 0, 0], ["leakyrelu_9", 0, 0]]], "config": {"mode_type": "raw", "name": "merge_1", "output_shape_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "mode": "sum"}, "class_name": "Merge", "name": "merge_1"}, {"inbound_nodes": [[["merge_1", 0, 0]]], "config": {"trainable": true, "size": [2, 2], "name": "upsampling2d_2"}, "class_name": "UpSampling2D", "name": "upsampling2d_2"}, {"inbound_nodes": [[["upsampling2d_2", 0, 0]]], "config": {"init": "glorot_uniform", "activation": "linear", "border_mode": "same", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "nb_col": 5, "bias": true, "dim_ordering": "tf", "name": "convolution2d_10", "b_constraint": null, "W_regularizer": null, "nb_filter": 64, "W_constraint": null, "nb_row": 5, "subsample": [1, 1]}, "class_name": "Convolution2D", "name": "convolution2d_10"}, {"inbound_nodes": [[["convolution2d_10", 0, 0]]], "config": {"trainable": true, "alpha": 0.01, "name": "leakyrelu_10"}, "class_name": "LeakyReLU", "name": "leakyrelu_10"}, {"inbound_nodes": [[["leakyrelu_1", 0, 0], ["leakyrelu_10", 0, 0]]], "config": {"mode_type": "raw", "name": "merge_2", "output_shape_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "mode": "sum"}, "class_name": "Merge", "name": "merge_2"}, {"inbound_nodes": [[["merge_2", 0, 0]]], "config": {"init": "glorot_uniform", "activation": "tanh", "border_mode": "same", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "nb_col": 9, "bias": true, "dim_ordering": "tf", "name": "convolution2d_11", "b_constraint": null, "W_regularizer": null, "nb_filter": 3, "W_constraint": null, "nb_row": 9, "subsample": [1, 1]}, "class_name": "Convolution2D", "name": "convolution2d_11"}], "name": "model_1"}, "class_name": "Model", "keras_version": "1.1.0"}